{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Steven&#39;s Coding Blog",
	"language": "en",
	"home_page_url": "https://gtmmiller.github.io/",
	"feed_url": "https://gtmmiller.github.io/feed/feed.json",
	"description": "I&#39;m writing about my coding projects here. Interested in Java, Godot, and Game Design.",
	"author": {
		"name": "Steven Miller",
		"url": "https://gtmmiller.github.io/about-me/"
	},
	"items": [
		{
			"id": "https://gtmmiller.github.io/blog/githubcleanup/",
			"url": "https://gtmmiller.github.io/blog/githubcleanup/",
			"title": "Cleaning Up My GitHub for a New Project",
			"content_html": "<p>I want to work on a new, exciting software project. But, whenever I try to get started I feel guilty about all the PRs, dependabot alerts, and old code I haven't addressed in my GitHub account. Seeing all of that pile up saps my motivation, but I'm sure I can take a week to get everything in order. My upcoming project is a clone of <a href=\"https://www.kingdomofloathing.com/\">The Kingdom of Loathing</a> using <a href=\"https://spring.io/projects/spring-boot\">SpringBoot</a> and <a href=\"https://htmx.org/\">htmx</a>. Stay tuned for Game Design, Architectural Design, and more from my upcoming project!</p>\n<p>With that introduction out of the way, let's go though my existing non-archived projects and see what I'm going to have to do to get this all cleaned up.</p>\n<h2 id=\"backlog-puller\" tabindex=\"-1\"><a href=\"https://github.com/GTmmiller/backlog_puller\">backlog_puller</a> <a class=\"header-anchor\" href=\"https://gtmmiller.github.io/blog/githubcleanup/\">#</a></h2>\n<p>This is a simple command-line utility for pulling game data from <a href=\"https://www.backloggery.com/\">The Backloggery</a>. I originally created it to retrieve data for spreadsheets and amateur data science stuff and thought other people might find it useful too.</p>\n<p>I recently got an email from the German research institute <a href=\"https://www.fortiss.org/en/\">fortiss</a> asking me about this package and I remembered that I left a few PRs hanging. The Backloggery recently had a <a href=\"https://www.patreon.com/posts/remake-launch-104736678\">total redesign</a>, so I suspect I may have to retire this project entirely, which would really be the end of an era for me. This has been my most successful personal software project in terms of overall engagement and usage.</p>\n<h3 id=\"action-items\" tabindex=\"-1\">Action Items <a class=\"header-anchor\" href=\"https://gtmmiller.github.io/blog/githubcleanup/\">#</a></h3>\n<ul>\n<li>Check if the redesign is compatible with the PR changes to update to Python 3</li>\n<li>Potentially EoL the project if it no longer works\n<ul>\n<li>Remove or mark as archived in PyPi</li>\n<li>find my pyPi credential</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"saga-frontier-combo-simulator\" tabindex=\"-1\"><a href=\"https://github.com/GTmmiller/saga-frontier-combo-simulator\">Saga Frontier Combo Simulator</a> <a class=\"header-anchor\" href=\"https://gtmmiller.github.io/blog/githubcleanup/\">#</a></h2>\n<p>I don't like the original Saga Frontier, but the 2021 remaster was my game of the year when it came out. I enjoyed it so much that I created a simulator for the game's combo system. It even did some small numbers <a href=\"https://www.reddit.com/r/SaGa/comments/xmx7dj/saga_frontier_combo_tool/\">in the SaGa subreddit</a>.</p>\n<p>I used full-strength Vue for this project. It was a good decision at the time, but looking at it now it feels like it was a little overkill. It doesn't call any apis and it's pretty much a simple one page tool. For now, I'll just update dependencies and make sure all the tests pass, but a rewrite using a lighter framework like <a href=\"https://alpinejs.dev/\">alpine.js</a> would be a fun project.</p>\n<h3 id=\"action-items-1\" tabindex=\"-1\">Action Items <a class=\"header-anchor\" href=\"https://gtmmiller.github.io/blog/githubcleanup/\">#</a></h3>\n<ul>\n<li>Update out of date dependencies</li>\n<li>Update node version to latest lts (v20)</li>\n<li>Ensure all tests pass and it works as expected</li>\n<li>Cut and deploy a new web release</li>\n</ul>\n<h2 id=\"plump\" tabindex=\"-1\"><a href=\"https://github.com/GTmmiller/plump\">Plump</a> <a class=\"header-anchor\" href=\"https://gtmmiller.github.io/blog/githubcleanup/\">#</a></h2>\n<p>This distributed lock service was originally going to be part of a series of projects I did as a supplement to my grad school coursework. Turns out, map reduce is much easier to model than distributed locking! I wanted this to take 1 month, but three years, and two language changes later it was finally done. I want to keep this around as long as I can since I use it as a reference project for a lot of setup I do in Java projects like setting up Unit Testing, Checkstyle, and multiple modules.</p>\n<h3 id=\"action-items-2\" tabindex=\"-1\">Action Items <a class=\"header-anchor\" href=\"https://gtmmiller.github.io/blog/githubcleanup/\">#</a></h3>\n<ul>\n<li>Turn on Dependabot warning</li>\n<li>Update any out of date dependencies</li>\n<li>Cut a new updated release if needed</li>\n</ul>\n<h2 id=\"brainf-inter\" tabindex=\"-1\"><a href=\"https://github.com/GTmmiller/brainf_inter\">brainf-inter</a> <a class=\"header-anchor\" href=\"https://gtmmiller.github.io/blog/githubcleanup/\">#</a></h2>\n<p>An interpreter of the <a href=\"https://en.wikipedia.org/wiki/Brainfuck\">Brainfuck langauge</a>. Though the name is a little crude, it's basically a simple language for representing a Turing machine.</p>\n<p>I've kept this project around because it's a fun blueprint for a javascript library that works on the browser and on Node at the same time. It's not very useful, but it's pretty lightweight and fun to keep around.</p>\n<h3 id=\"action-items-3\" tabindex=\"-1\">Action Items <a class=\"header-anchor\" href=\"https://gtmmiller.github.io/blog/githubcleanup/\">#</a></h3>\n<ul>\n<li>Update dependencies</li>\n<li>make sure the latest lts verison of Node is called for</li>\n<li>check if this is still best practice for a package for the browser and nodejs</li>\n<li>Redeploy to npm</li>\n</ul>\n<h2 id=\"archiving\" tabindex=\"-1\">Archiving <a class=\"header-anchor\" href=\"https://gtmmiller.github.io/blog/githubcleanup/\">#</a></h2>\n<p>I have a bunch of old projects that I don't want to maintain anymore, but I like to keep around for sentimental or other reasons.</p>\n<p><strong>hex-game</strong> - An incomplete implementation of the game <a href=\"https://en.wikipedia.org/wiki/Hex_(board_game)\">Hex</a>. I might revisit this in Godot as a simple game exercise.</p>\n<p><strong>hde-twitter-like</strong> - A twitter clone I made for an internship that I quite enjoyed. Not going to update this one any time soon, but I have some great memories from that internship. Checkout the <a href=\"https://hennge.com/global/gip.html\">Hennge global internship program</a> if you're interested in working and living in Tokyo for a bit.</p>\n<p><strong>pokego-evol-maximizer</strong> - This was supposed to calculate the amount of pokemon you can transfer to maximize the number of pokemon you could evolve from the candy resulting from the transfer. This never quite worked correctly, but it gave me lot of valuable experience with numpy.</p>\n<p><strong>bankinator</strong> - I made this application to sign into my bank account and pull information. The bank I wrote this for is now defunct and this was before the days of open banking apis. It doesn't work and I don't want to update it.</p>\n<h2 id=\"moving-forward\" tabindex=\"-1\">Moving Forward <a class=\"header-anchor\" href=\"https://gtmmiller.github.io/blog/githubcleanup/\">#</a></h2>\n<p>I'm excited to get cleaning and to move on to my next project! Next post should be next week detailing how the clean up went and I should get some time to start writing up the intro to the new project.</p>\n<p>See you in the next post!</p>\n",
			"date_published": "2024-08-20T00:00:00Z"
		}
		
	]
}
